<?php
// Version: 2.0; Help

global $helptxt;

$txt['close_window'] = 'إغلاق النافذة';

$helptxt['manage_boards'] = '
	<b>تعديل المنتديات</b><br />
	في هذه القائمة تستطيع إنشاء/إعادة ترتيب/حذف المنتديات, و التصنيفات التي تضمها. كمثال, إذا كنت تملك موقع يتناول مواضيع متنوعة من معلومات عن &quot;الرياضة&quot; و &quot;السيارات&quot; و &quot;الموسيقى&quot;, فإنها ستكون التصنيفات العليا ضمن منتداك. تحت كل تصنيف ستقوم على الأغلب بإنشاء بشكل شجري &quot;تصنيفات فرعية&quot;,
	أو &quot;منتديات&quot; للمواضيع ضمن كل واحدة منها. يعتبر هذا توزيع شجري بسيط, وبنيته: <br />
	<ul>
		<li>
			<b>الرياضة</b>
			&nbsp;-  &quot;تصنيف&quot;
		</li>
		<ul>
			<li>
				<b>كرة القدم</b>
				&nbsp;- منتدى تحت تصنيف &quot;الرياضية&quot;
			</li>
			<ul>
				<li>
					<b>النجوم</b>
					&nbsp;- منتدى فرعي من منتدى &quot;الرياضة&quot;
				</li>
			</ul>
			<li><b>كرة السلة</b>
			&nbsp;- منتدى تحت تصنيف &quot;الرياضة&quot;</li>
		</ul>
	</ul>
	التصنيفات تسمح لك بكسر المنتدى إلى منتديات للمواضيع (&quot;سيارات,
	رياضة&quot;), و &quot;منتديات&quot; التي تحتها هي التي تحوي المواضيع التي يقوم الأعضاء بإرسالها.
	يمكنك إرسال مواضيع تحت &quot;سيارات->Pinto&quot;. التصنيفات تسمح للناس بإيجاد و بسرعة اهتماماتهم: بدلا من &quot;محل&quot; فإنك تملك 
	&quot;أدوات&quot; و &quot;ألبسة&quot; stores you can go to. هذا يبسط بحثك عن &quot;قطعة مفاصيل الأنابيب&quot; لأنك تستطيع الذهاب إلى محل قسم الأدوات &quot;تصنيف&quot; بدلا من قسم الألبسة (الذي على الأغلب لن تجده ضمنه هذه المفاصل).<br />
	كما لاحظنا, المنتدى عبارة عن فهرس للمواضيع تحت تصنيف المنتدى. في حال أردت أن تناقش &quot;Pintos&quot; فإنك سوف تذهب إلى &quot;آنيا&quot; إلى التنصيف الخاص به ثم الدخول إلى منتدى &quot;Pinto&quot; من أجل المشاركة بآرائك في ذلك المنتدى.<br />
	 وظائف الإدارة لهذه القائمة هي إنشاء منتدى تحت كل تصنيف, إعادة ترتيبهم (وضع &quot;Pinto&quot; بعد &quot;Chevy&quot;), أو لحذف المنتدى بشكل كامل.';

$helptxt['edit_news'] = '<b>تعديل أخبار المنتدى</b><br />
	هذا الخيار يسمح لك بأسناد نص الأخبار لكي يتم عرضها على صفحة فهرس المنتدى. إضافة أية عنصر تريده (مثال, &quot;لا تنسى موعد الاجتماع هذا الخميس&quot;). كل خبر يجب أن يوضع في صندوق مستقل, و يتم عرضها بشكل عشوائي.';

$helptxt['view_members'] = '
	<ul>
		<li>
			<b>عرض الأعضاء</b><br />
			عرض كل أعضاء المنتدى. إنك تستعرض قائمة بروابط أسماء الأعضاء. يمكنك الضغط على أية اسم لتشاهد تفاصيل هذا العضو (صفحة الويب, العمر, إلخ.), و كمدير تستطيع أن تعدل هذه المدخلات. إنك تملك صلاحية التحكم الكاملة على معلومات الأعضاء, بالإضافة إلى القدرة على حذفهم من المنتدى.<br /><br />
		</li>
		<li>
			<b>ينتظرون الموافقة</b><br />
			هذا القسم يظهر فقط في حال كنت مفعل خيار موافقة المدير للأعضاء المسجلين جدد. كل شخص يسجل حساب جديد للانضمان إلى المنتدى يصبح عضوا كامل فقط في حال تمت الموافقة عليه من قبل مدير. القسم يظهر كل الأعضاء الذين لم يتم الموافقة على عضويتهم بعد, بالإضافة إلى عنوان البريد الاكتروني و عنوان الأي بي(IP). يمكنك اختيار الموافقة أو الرفض(حذف) أي عضو موجود على القائمة من خلال اختيار الصندوق بجانبه و اختيار العملية المناسبة من صندوق القائمة المنسدلة في أسفل الصفحة. عند رفض العضو قم باختيار حذف بإرسال تنبيه أو عدم إرساله عن قرارك.<br /><br />
		</li>
		<li>
			<b>ينتظرون التفعيل</b><br />
			هذا القسم يظهر فقط فق حال فعلت خيار تفعيل الحساب عن طريق العضو نفسه. هذا القسم سوف يحوي كل الأعضاء الذين لم يفعلوا حسابهم الجديد. من خلال هذه الصفحة تستطيع أن تقبل, ترفض أو تذكر الأعضاء بحالة حسابهم. كما في الفقرة السابقة يمكنك أن تختار إرسال بريدا إلى بريدهم الالكتروني لإعلام العضو بالفعل الذي قمت به.<br /><br />
		</li>
	</ul>';

$helptxt['ban_members'] = '<b>حرمان العضو</b><br />
	يقدم المنتدى القدرة على &quot;حرمان&quot; الأعضاء, لمنع الناس الذين يخالفون قواعد مشاركة المنتدى عن طريق الإعلان, و غيرها. يسمح لك هذا القسم بفعل ذلك للأعضاء الذين يحاولون الإساءة إلى المنتدى. بصفتك المدير, عند مشاهدة المشاركات, تستطيع مشاهدة عنوان الاي بي لكل عضو قد قام بالمشاركة ضمن منتداك. في قائمة الحرمان, بكل بساطة تكتب عنوان الاي بي, حفظ, بعدها لن يستطيعوا المشاركة من نفس العنوان مرة أخرى.<br />You can also
	ban people through their email address.';

$helptxt['featuresettings'] = '<b>تحرير المزايا و الخيارات</b><br /> هذه الصفحة تسمح لك بتغير إعدادات المزايا و المعدلات والخيارات الأساسية لمنتداك.';

$helptxt['securitysettings'] = '<b>الحماية و الإشراف</b><br />  هنا ستجد إعدادات الحماية و إعدادات إشراف المنتدى الخاص بك. ';

$helptxt['modsettings'] = '<b>تحرير المزايا و الخيارات</b><br />
هذه الصفحة تسمح لك بتغير إعدادات المزايا و المعدلات والخيارات الأساسية لمنتداك.';

$helptxt['number_format'] = '<b>شكل الرقم</b><br />
	يمكن استخدام هذه الإعدادات لتتحكم بالشكل الذي تظهر به الأرقام في المنتدى للمتصفح. الشكل هو:<br />
	<div style="margin-left: 2ex;">1,234.00</div><br />
	حيث \',\' هو الرمز المستخدم لفصل مجموعة الآلاف, \'.\' هو الرمز المستخدم كفاصلة عشرية و عدد الأصفار للتحكم بدقة ترجيح الرقم.';

$helptxt['time_format'] = '<b>شكل الوقت</b><br />
      بإمكانك أن تقوم بتعديل كيفية ظهور شكل الوقت و التاريخ لك. ستجد الكثير من الأحرف لكي تستخدمها ولكن العملية بسيطة.
	التعريفات التالية تتبع وظيفة PHP للوقت ، وهي مشروحة بالتفصيل في الأسفل ،(لمعلومات وافية يمكنك زيارة الموقع التالي:<a href=\\"http://www.php.net/manual/function.strftime.php\\">php.net</a>).<br>
	<br>
	الأحرف التالية تستخدم لتشكيل الوقت و التاريخ: <br>
	<br />
	<span class="smalltext">
	&nbsp;&nbsp;%a - لاختصار اسم اليوم في الأسبوع<br>
	&nbsp;&nbsp;%A - اسم يوم الأسبوع كاملا<br>
	&nbsp;&nbsp;%b - لاختصار اسم الشهر<br> 
	&nbsp;&nbsp;%B - اسم الشهر كاملا<br>
	&nbsp;&nbsp;%d - يوم الأسبوع (01 إلى 31) <br>
	&nbsp;&nbsp;%D - مشابه لـ %m/%d/%y <br>
	&nbsp;&nbsp;%e - يوم الأسبوع (1 إلى 31)<br>
	&nbsp;&nbsp;%H - الساعة باستخدام توقيت 24 (00 إلى 23) <br>
	&nbsp;&nbsp;%I - الساعة باستخدام توقيت 12 (01 إلى 12) <br>
	&nbsp;&nbsp;%m - الشهر كرقم (01 إلى 12) <br>
	&nbsp;&nbsp;%M - الدقيقة كرقم <br>
	&nbsp;&nbsp;%p - إما \\"am\\" أو \\"pm\\" بحسب شكل الوقت المستخدم<br>
	&nbsp;&nbsp;%R - الوقت بحسب علامات 24 ساعة <br>
	&nbsp;&nbsp;%S - الثواني كرقم عشري <br>
	&nbsp;&nbsp;%T - التوقيت الحالي ،مساويا لـ %H:%M:%S <br>
	&nbsp;&nbsp;%y - سنة ذات خانتان (00 إلى 99) <br>
	&nbsp;&nbsp;%Y - سنة ذات أربع خانات<br>
	&nbsp;&nbsp;%Z - منطقة الوقت أو الاسم أو الاختصار <br>
	&nbsp;&nbsp;%% - حرفي \'%\'<br>
	<br />
	<i>* لا تعمل مع ملقمات ويندوز.</i></span>';

$helptxt['live_news'] = '<b>اخر الأخبار مباشرتا</b><br />
هذا الصندوق يظهر لك أخر الأخبار من<a href="http://www.simplemachines.org/" target="_blank">www.simplemachines.org</a>.
يجب عليك  مشاهدة هذا الصندوق من الحين الى الأخر لمعرفة أخر التحديثات . ,';

$helptxt['registrations'] = '<b>معالجة التسجيل </b><br />
	بامكانك تغيير العديد من اعدادات الاعضاء الجدد في هذا المكان.
	و هى مرتبه كالتالى :<br /><br />
	<ul>
		<li>
			<b>تسجيل عضو جديد</b><br />
			هنا يمكنك تسجيل اعضاء جدد في المنتدى و تستطيع ارسال رسالة الى ايميلاتهم<br /><br />
		</li>
		<li>
			<b>تحرير اتفاقية التسجيل</b><br />
			هذه الاتفاقية ستعرض إذا قمت بتمكين خيار عرض اتفاقية التسجيل في إعدادات المنتدى.<br /><br />
		</li>
		<li>
			<b>ضبط الأسماء المحجوزة</b><br />
			الأسماء المحجوزة ستمنع الأعضاء من التسجيل باستخدام تلك الأسماء التي تم حجزها سواء كاسم مستخدم أو اسم للعرض. اختر الخيار الذي ترغب في تنفيذه بالأسفل قبل أن تتم العملية.<br /><br />
		</li>
		<li>
			<b>اعدادات</b><br />
			بامكانك تغيير العديد من اعدادات الاعضاء الجدد في هذا المكان.
		</li>
	</ul>';

$helptxt['modlog'] = '<b>سجل الإشراف</b><br />
	هذا القسم يسمح للمديرين بتعقب جميع الإجرائات التى قام بها المشرفين. لضمان أن المشرفين لن يقومى بحذف اى شئ قامو به , لن يتم مسح الإجرائات التى قامو بها إلا بعد مرور 24 ساعه.
	The \'objects\' column lists any variables associated with the action.';
$helptxt['adminlog'] = '<b>سجل المدير</b><br /> هذا القسم يسمح لأعضاء فريق الإدارة لتعقب بعض الأجراءات الإدارية التي إتخذت بالمنتدى. لضمان أن أعضاء فريق الإدارة لا يستطيعون إزالة المراجع إلى الأجراءات التي أتخذوها، يجب أن لا تحذف مداخلاتهم إلا بعد مرور 24 ساعة على الإجراء الذي أتخذ.';
$helptxt['warning_enable'] = '<b>نظام إنذارات الأعضاء</b><br /> تمكّن هذه الميزّة فريق الإدارة لإصدار الإنذارات إلى الأعضاء - ولإستعمال مستوى الإنذارات للأعضاء لإتخاذ الإجراءات اللازمة ضدهم بالمنتدى. وعند تمكين هذه الميزّة، الصلاحية ستكون متاحة ضمن قسم الصلاحيات لتحديد الفئات 
التي يجوز لها أن تعطي الإنذارات للأعضاء. مستويات الإنذارات يمكن تعديلها من خلال الملفات الشخصية للأعضاء. الخيارات الإضافية توفر التالي: <ul> <li> <b>مستوى إنذار مراقبة العضو</b><br /> هذا الإعداد يحدد مستوى النسبة المئوية للإنذار التي يمكن أن يصل 
إليها العضو لتسند إليه تلقائياً &quot;عضو تحت المراقبة&quot; . أي عضو تم إعتباره كـ&quot;عضو تحت المراقبة&quot; سوف يظهر في المنطقة ذات العلاقة في مركز المشرفين. </li> <li> <b>مستوى الإنذار للإشراف على المشاركة</b><br /> أيّ عضو يتجاوز القيمة المحددة لهذا الإعداد سيجد كلّ مشاركاته تتطلّب موافقة المشرفين قبل ظهورها بالمنتدى. وهذا من شأنه تجاوز أيّ صلاحيات موجودة مسبقاً متعلّقة بالإشراف على المشاركات. </li> <li> <b>مستوى الإنذار لإيقاف العضو من المشاركة</b><br /> اذا تجاوز العضو مستوى هذا الإنذار سيجد نفسه تحت وطأة الإيقاف وفقدان جميع الصلاحيات للمشاركة. </li> <li> <b>الحد الأقصى لنقاط الإنذار للعضو باليوم</b><br /> هذا الإعداد سيحدد عدد النقاط التي يمكن للمشرف أن يضيفها / يحذفها إلى أيّ عضو معيّن خلال فترة أربع وعشرون ساعة. ويمكن أن يستعمل لتحديد عمل المشرف خلال فترة زمنية صغيرة. هذا الإعداد يمكن إلغاءه بوضع القيمة إلى صفر. لاحظ أن أيّ عضو مرخص كمدير سوف لن يتأثّر بهذه القيمة. </li> </ul>';
$helptxt['error_log'] = '<b>سجل الأخطاء</b><br /> يتعقب سجل الأخطاء أي خطا يرد في منتداك. هذه القائمة عبارة عن قائمة زمنية بالأخطاء التي حدثت. لحذف أي خطا من قاعدة البيانات قم بالتعليم عليه ثم اضغط زر حذف في أسفل الصفحة..';
$helptxt['theme_settings'] = '<b>إعدادات القالب</b><br /> هنا يمكنك تغير إعدادات القالب الحالى. هذه الإعدادات مثل رابط الثيم و إعدادات اخرى مثل تمكين الأخبار و اعدادات اخرى تساعد على تنظيم شكل المنتدى . ';
$helptxt['smileys'] = '<b>مركز الابتسامات</b><br />
	هنا يمكنك أن تضيف أو تحذف الابتسامات, و مجموعات الابتسامات.  تذكر بأن الابستامسة إن وجدت في مجموعة ما, فانها يجب أن تتوفر في بقية المجموعات, it might
	و إلا لأصبح من الصعب على مستخدميك استخدام الابتسامات المختلفة.';
$helptxt['calendar'] = '<b>إدارة التقويم</b><br /> هنا تستطيع إضافة أو حذف أي عطل موجودة في التقويم ';

$helptxt['serversettings'] = '<b>إعدادات الملقم</b><br /> هذه الصفحة تسمح لك بتغير الإعدادات الأساسية للمنتدى. فهى تحتوى على إعدادت قاعدة البيانات و الروابط الخاصه بالمنتدى و من أهم هذه الإعدادات بريد مدير الموقع و اسم السكاكر , كن حذرا مع التعامل مع هذه الإعدادات التي قد يودي سوء استخدامه إلى تعطيل المنتدى.
';
$helptxt['manage_files'] = '	<ul>
		<li>
			<b>تصفح الملفات</b><br />
			تصفح جميع المرفقات , الصور الشخصية و الصور المصغرة التى تم حفظها من قبل SMF.<br /><br />
		</li><li>
			<b>إعدادات المرفقات</b><br />
			تهيئة أين يتم حفظ المرفقات و وضع قيود على أنواع المرفقات المختلفة.<br /><br />
		</li><li>
			<b>إعدادات الصور الشخصية</b><br />
			تهيئة أين يتم حفظ الصور الشخصية و التحكم فى تحجيم الصور.<br /><br />
		</li><li>
			<b>صيانة الملفات</b><br />
			فحص و إصلاح أى خطأ فى مجلد المرفقات و حذف المرفقات المختارة.<br /><br />
		</li>
	</ul>';

$helptxt['topicSummaryPosts'] = 'يمكنك أن تحدد هنا عدد الرسائل التي ستظهر في ملخص الموضوع في شاشة الرد.';
$helptxt['enableAllMessages'] = 'ضع هنا <em>الحد الأقصى</em> لعدد المشاركات الخاصه بالمواضيع لكى تظهر الوصلات. و إذا كانت أقل من  &quot; الحد الأقصى  من الرسائل لتظهر فى صفحات الموضوع &quot; ستعنى بكل بساطه أنها لن تظهر, و سوف تقوم بإبطاء منتداك.';
$helptxt['enableStickyTopics'] = 'المواضيع الثابتة هي تلك التي تبقى في أعلى قائمة المواضيع. تستخدم عادة من أجل المواضيع المهمة. يمكن 
		للمراقبين و المشرفين فقط جعل المواضيع ثابتة.';
$helptxt['allow_guestAccess'] = 'إن عدم إختيار هذه الميزه فانك سوف تمنع الزوار من عمل أى شئ لكن يمنهم فقط تسجيل الدخول , استرجاع كلمة السر , التسجيل , الخ - فى المنتدى الخاص بك . لاحظ أن هذه الميزه مختلفه عن ميزة منع الزوار من مشاهدة قسم معين من الموقع .';
$helptxt['userLanguage'] = 'تمكين هذا الخيار يتيح للمستخدم اختيار ملف اللغة الذي يود استخدامه. لن يوثر ذلك على الخيار الافتراضي.';
$helptxt['trackStats'] = 'إحصاءات:<br />لتمكين المستخدم من مشاهدة الرسائل الحديثة و المواضيع ذات الشعبية في منتداك.
		كما يمكن كذلك مشاهدة إحصاءات أخرى مثل أغلب المتصلين و الأعضاء الجدد و المواضيع الجديدة.<hr />
		النقرات:<br />لمشاهدة عدد النقرات لمنتداك و ستعرض في صفحة الإحصاءات.';
$helptxt['titlesEnable'] = 'تمكين هذا الخيار سيسمح للأعضاء بإنشاء عناوين مخصصة لأنفسهم. وسيتم عرضها
		في أسفل أسمائهم.<br /><i>مثال:</i><br />احمد<br />دعم فني';
$helptxt['topbottomEnable'] = 'تمكين هذا الخيار سيقوم بعرض زرين للذهاب إلى أعلى و أسفل، مما يمكن الأعضاء من النقر عليهما للاستغناء عن التصفح.';
$helptxt['onlineEnable'] = 'لعرض صورة توضح ما إذا كان العضو متصل أم لا.';
$helptxt['todayMod'] = 'لعرض اليوم ، الأمس بدلا من التاريخ';
$helptxt['disableCustomPerPage'] = 'هذا الخيار هو لمنع الأعضاء من تخصيص عرض عدد المشاركات والمواضيع لكلّ صفحة في فهرس المشاركات والمواضيع على التوالي.';
$helptxt['enablePreviousNext'] = 'عرض رابط السابق و اللاحق للمواضيع.';
$helptxt['pollMode'] = 'هذا يمكن تعطيل أو تمكين الاقتراعات. إذا تم تعطيل الاقتراعات فسيتم إخفاء أية اقتراعات موجودة مسبقا من عرضها في الموضوع. يمكنك مواصلة مشاهدة موضوع ذلك الاقتراع باختيار "عرض الاقتراعات الموجودة كمواضيع". يمكنك كذلك تحديد من يحق له كتابة الاقتراعات من قائمة التصريحات.';
$helptxt['enableVBStyleLogin'] = 'لعرض حقل يستخدم للدخول في أسفل الصفحة.';
$helptxt['enableCompressedOutput'] = 'لضغط المخرجات من أجل التوفير في عرض الحزمة المستخدم و لكنه يتطلب وجود مكتبة zlib مثبتة.';
$helptxt['disableTemplateEval'] = 'By default, templates are evaluated instead of just included. This helps with showing more useful debug information in case a template contains an error.<br /><br />
		On large forums however, this customised inclusion process may be significantly slower. Therefore, advanced users may wish to disable it.';
$helptxt['databaseSession_enable'] = 'هذا الخيار يستخدم إمكانية تخزين الجلسة في قاعدة البيانات - يعتبر خيار مثالي للملقمات لتوزيع الأحمال ، ويساعد في حل اغلب مشاكل انقضاء الوقت للجلسة و يسرع المنتدى. و لكنه لا يعمل إذا كانت خاصية session.auto_start على وضع on.';
$helptxt['databaseSession_loose'] = 'تنشيط هذا الخيار سيقلل من موجة حجم البيانات المستهلكة من قبل المنتدى، و سيجعل العودة للصفحة السابقة تتم من دون التحديث. الجانب السيئ إن بعض العناصر لن يتم تحديثها كالأيقونات مثلا إلا في حال نقرك على رابط ذلك الموضوع بدلا من العودة للخلف';
$helptxt['databaseSession_lifetime'] = 'هذا هو عدد الثواني للجلسات قبل أن تنتهي إذا لم يتم الوصول إليهم. إذا لم يتم الوصول إلى الجلسة لمدة طويلة فسيتم إنهائها بانقضاء الوقت. يفضل استخدام رقم أعلى من 2400 .';
$helptxt['enableErrorLogging'] = 'لتمكين تسجيل الأخطاء ، مثل محاولة الدخول الخاطئة ، لتتمكن من معرفتها لاحقا.';
$helptxt['enableErrorQueryLogging'] = 'This will include the full query sent to the database in the error log.  Requires error logging to be turned on.<br /><br /><strong>Note:  This will affect the ability to filter the error log by the error message.</strong>';
$helptxt['allow_disableAnnounce'] = 'هذه الميزة سوف تسمح للأعضاء بلإنسحاب من إستلام تنبيهات المواضيع الإعلانيه و الردود الجديده بالضغط على  &quot;موضوع إعلاني.&quot; أثناء كتابت الموضوع.';
$helptxt['disallow_sendBody'] = 'هذا الخيار سوف يمنع ظهور نص الردود التى سوف تظهر فى رسالة التنبيه التى سوف تصل للأعضاء.<br /><br />أحيانا , يقوم الأعضاء بالرد على رسالة التنبيه التى تصلهم , مما يعنى انهم سوف يرسلون رساله لصاحب الموقع.';
$helptxt['compactTopicPagesEnable'] = '.<br /><i>مثال:</i><br />
		\\"3\\" لعرض: 1 ... 4 [5] 6 ... 9 <br />
		\\"5\\" لعرض: 1 ... 3 4 [5] 6 7 ... 9';
$helptxt['timeLoadPageEnable'] = 'لعرض الوقت بالثواني الذي يستخدمه SMF لإنشاء الصفحة، يعرض في نهاية الصفحة.';
$helptxt['removeNestedQuotes'] = 'لعرض الاقتباس المستخدم فقط من دون عرض أية اقتباسات متداخلة أخرى.';
$helptxt['simpleSearch'] = 'لعرض شاشة بحث مختصرة مع إمكانية استخدام البحث المتقدم.';
$helptxt['max_image_width'] = 'تسمح لك هذه اليزه يتحديد الحد الأقصى للصور التى يتم وضعها بمواضيع المنتدى , لاحظ أن الصور التى سيكون عرضها او طولها أصغر من الجد الأقصى فئنها ستظل كما هى.';
$helptxt['mail_type'] = 'لتحديد برنامج البريد لـ php الافتراضي. أو إذا كنت تود استخدام ملقم البريد. قم بتعبئة البيانات إذا كنت لا تود استخدام sendmail';
$helptxt['attachment_manager_settings'] = 'الملحقات هي عبارة عن الملفات التي يمكن للمستخدمين من تحميله و إلحاقها بالرسالة.<hr /> التحقق من لاحقة الملحق:<br /> إذا ما كنت تود التأكد من اللاحقة أم لا.<br /> السماح بلواحق الملحقات:<br /> لتحديد اللواحق التي تود السماح لها بالاستخدام.<br /> عرض الملحق كصورة في الرسالة:<br /> إذا كان الملف الملحق هو صورة فسيتم عرضه في نهاية الرسالة.<br /> مسار تحميل الملحقات:<br /> مسار مجلد اللواحق<br />(مثال: /home/sites/yoursite/www/forum/attachments)<br /> مكانURL الملحقات:<br /> عنوان url لمجلد اللواحق<br />(مثال: http://www.yoursite.com/forum/attachments)<br /> أقصى حجم لمجلد الملحقات (بالكيلو بايت):<br /> تحديد حجم مجلد اللواحق.<br /> أقصى حجم للملحقات لكل رسالة:<br /> حدد الحجم الكلي لكافة الملحقات للرسالة الواحدة. إذا كان الحجم أقل من (أقصى حجم للملحقات) فسيتم إعتماده.<br /> أقصى حجم للملحقات (بالكيلو بايت):<br /> تحديد الحجم الأقصى للملف الملحق.<br /> أقصى عدد للملحقات لكل رسالة: <br />تحديد عدد الملحقات التي يمكن للمستخدم إضافتها لكل رسالة.<br />';
$helptxt['attachment_image_paranoid'] = 'Selecting this option will enable very strict security checks on image attachments. Warning! These extensive checks can fail on valid images too. It is strongly recommended to only use this option together with image re-encoding, in order to have SMF try to resample the images which fail the security checks: if successful, they will be sanitized and uploaded. Otherwise, if image re-encoding is not enabled, all attachments failing checks will be rejected.';
$helptxt['attachment_image_reencode'] = 'Selecting this option will enable trying to re-encode the uploaded image attachments. Image re-encoding offers better security. Note however that image re-encoding also renders all animated images static. <br /> This feature is only possible if the GD module is installed on your server.';
$helptxt['avatar_paranoid'] = 'Selecting this option will enable very strict security checks on avatars. Warning! These extensive checks can fail on valid images too. It is strongly recommended to only use this option together with avatars re-encoding, in order to have SMF try to resample the images which fail the security checks: if successful, they will be sanitized and uploaded. Otherwise, if re-encoding of avatars is not enabled, all avatars failing checks will be rejected.';
$helptxt['avatar_reencode'] = 'Selecting this option will enable trying to re-encode the uploaded avatars. Image re-encoding offers better security. Note however that image re-encoding also renders all animated images static. <br /> This feature is only possible if the GD module is installed on your server.';
$helptxt['karmaMode'] = 'كارما هي خاصية لعرض مدى شعبية العضو. يمكنك تحديد عدد الرسائل لتحصل على الكارما، الوقت بين الترشيحات ، وتحديد ماذا كان المشرفين عليهم الانتظار من عدمه.';
$helptxt['cal_enabled'] = 'يستخدم التقويم لعرض تواريخ الميلاد أو الأحداث المهمة لمجموعتك.<hr />
		عرض الأيام كوصلة لكتابة الحدث:<br />للسماح للأعضاء بكتابة الحدث عن الضغط على التاريخ.<br />
		بدء الأسبوع بيوم الاثنين:<br /> عرض يوم الاثنين في يسار الشاشة دائما.<br />
		عرض أرقام الأسابيع:<br />لعرض ما هو الأسبوع.<br /> 
		عرض الإجازات في فهرس المنتدى<br /> 
		عرض تواريخ الميلاد في فهرس المنتدى<br />  
		عرض الأحداث في فهرس المنتدى<br />  
		أقل سنة:<br />تحديد أول سنة في قائمة التقويم.<br />  
		أعلى سنة:<br />تحديد آخر سنة في قائمة التقويم.<br /> 
		لون العنوان:<br />تحديد لون النص.<br />  
		لون اليوم الحالي:<br />تحديد لون اليوم الحالي.<br />
		لون تاريخ الميلاد:<br />تحديد لون نص تاريخ الميلاد.<br />
		لون الحدث:<br />تحديد لون نص الحدث الحالي.<br />
		لون الإجازة:<br />تحديد لون نص الإجازة.<br />
		السماح للأحداث بأن تمتد لأيام متعددة:<br />تحديد امتداد الأحداث في أكثر من يوم.<br />
		أقصى عدد للأيام يمكن أن يمتد الحدث فيه:<br />تحديد أقصى عدد للأيام.<br />
		جميع الأعضاء يسمح لهم بالكتابة:<br />السماح لجميع الأعضاء من عدمه.<br />
		المجموعات المسموح لها بالكتابة:<br />تحديد مجموعة الأعضاء التي يسمح لها بالكتابة.<br />
		الأعضاء المسوح لهم بالكتابة:<br />تحديد الأعضاء الذين يسمح لهم بالكتابة.<br />
		المنتدى الافتراضي لكتابة الحدث:<br />تحديد المنتدى الذي سيتم كتابة الأحداث فيه.';
$helptxt['localCookies'] = 'يستخدم SMF السكاكر لتخزين معلومات الدخول في جهاز العميل. 
	السكاكر يمكن أن تخزن بشكل شامل (myserver.com) أو بشكل محلي (myserver.com/path/to/forum).<br />
	علم على هذا الخيار إذا كان المستخدمون يعانون من حالات خروج تلقائية من المنتدى.<hr />
	السكاكر التي تخزن بشكل شامل تكون أقل أمانا عند استخدامها في ملقم ويب للمشاركة (مثل Tripod).<hr />
	السكاكر المحلية لن تعمل خارج مجلد المنتدى، فإذا كان منتداك يقع في www.mysserver.com/forum  فأن صفحات مثل www.myserver.com/index.php لن تستطيع الوصول إلى معلومات الدخول للحساب.
	خصوصا عند استخدام SSI.php  وفي هذه الحالة ينصح باستخدام السكاكر الشاملة.';
$helptxt['enableBBC'] = 'تحديد هذا الخيار سيسمح للأعضاء باستخدام رموز المنتدى BBC في منتداك. والتي تسمح للأعضاء بتشكيل رسائلهم حسبما يودون.';
$helptxt['time_offset'] = 'لا يرغب كافة المشرفين باستخدام منطقة الزمن الخاصة بنفس الملقم المثبت عليه المنتدى. استخدم هذه الميزة لتحديد فوارق التوقيت (بالساعات) بين الملقم و المنتدى. القيم العشرية و السلبية ممكنة.';
$helptxt['default_timezone'] = 'النظام الزمنى للخادم يخبر PHP بالمكان الموجود به الخادم الخاص بك. يجب عليك التأكد من أن التوقيت صحيح, طبقا للدولة/المدينة الموجود بها المدينة. يمكنك الحصول على مزيد من المعلومات عن طريق هذا الموقع <a href="http://www.php.net/manual/en/timezones.php" target="_blank">PHP Site</a>. ';
$helptxt['spamWaitTime'] = 'هنا يمكنك تحديد الوقت اللازم توفره بين كتابة كل رسالة ، تستخدم هذه الميزة من أجل إيقاف الأشخاص من كتابة الرسائل التطفلية في منتداك.';

$helptxt['enablePostHTML'] = 'يسمح بكتابة بعض دوال HTML الأساسية:
	&lt;b&gt;, &lt;u&gt;, &lt;i&gt;, &lt;pre&gt;, &lt;blockquote&gt;, &lt;img src=&quot;&quot; /&gt;, &lt;a href=&quot;&quot;&gt;, and &lt;br /&gt;.';

$helptxt['themes'] = 'هنا يمكنك تحديد إمكانية اختيار القالب الافتراضي، ما هو القالب الخاص بالضيوف بالإضافة إلى خيارات أخرى. انقر على القالب الموجود في اليمين لتغير إعداداته.';
$helptxt['theme_install'] = 'يمكنك هذا الخيار من تثبيت قوالب جديدة.  يمكنك فعل ذلك من خلال مجلد تم إنشائه للتو, بواسطة تحميل أرشيف القالب, أو بواسطة النقر على القالب الافتراضي.<br /><br />تذكر أن الأرشيف أو المجلد يجب أن يحتوي على ملف التعريف <tt>theme_info.xml</tt> بداخله.';
$helptxt['enableEmbeddedFlash'] = 'هذا الخيار سيسمح للمستخدمين من استعمال الفلاش مباشرة في الرسائل، مثل الصور. قد يسبب ذلك خطر أمنيا (بالرغم من أن القلة تمكنوا من استغلال تلك الثغرة الأمنية). استخدمه على مسؤوليتك.';
// !!! Add more information about how to use them here.
$helptxt['xmlnews_enable'] = 'السماح للأشخاص من وضع وصلة لـ <a href="%s?action=.xml;sa=news">الأخبار الحديثة</a>
	و البيانات المشابه.  من المستحسن تحديد حجم الرسائل/الأخبار الحديثة بسبب, عندما يتم عرض بيانات rss 
	بعض الزبائن، مثل Trillian، فمن المتوقّع قطع البيانات الزائدة';
$helptxt['hotTopicPosts'] = 'تغير عدد الرسائل للموضوع لكي يصبح &quot;شائع&quot; أو
	&quot;شعبي&quot;.';
$helptxt['globalCookies'] = 'السماح باستخدام السكاكر المستقلة للنطاق الفرعي. على سبيل المثال إذا كان<br />
	موقعك موجود على http://www.simplemachines.org/,<br />
	و منتداك موجود في http://forum.simplemachines.org/,<br />
	فهذه الميزة تسمح لك بالوصول إلى ملف السكاكر في منتداك.';
$helptxt['secureCookies'] = 'Enabling this option will force the cookies created for users on your forum to be marked as secure. Only enable this option if you are using HTTPS throughout your site as it will break cookie handling otherwise!';
$helptxt['securityDisable'] = 'هذا <i>يعطل</i> التحقق الإضافي من كلمة المرور لقسم الإشراف. لا ينصح بتعطيلها!';
$helptxt['securityDisable_why'] = 'هذه هي كلمة المرور الحالية. (نفس الكلمة التي تستخدمها لتسجيل الدخول.)<br /><br />ضرورة كتابتها مرة أخرى من اجل التأكد من <b>انك</b> أنت صاحبها الفعلي.';
$helptxt['emailmembers'] = 'في هذه الرسالة يمكنك استخدام بعض &quot;المتغيرات&quot;.  وهي:<br />
	{\\$board_url} - URL الخاص بمنتداك.<br />
	{\\$current_time} - الوقت الحالي.<br />
	{\\$member.email} - عنوان بريد العضو الحالي.<br />
	{\\$member.link} - وصلة العضو الحالي.<br />
	{\\$member.id} - id العضو الحالي.<br />
	{\\$member.name} - اسم العضو الحالي.  (من أجل التخصيص.)<br />
	{\\$latest_member.link} - وصلة آخر عضو مسجل.<br />
	{\\$latest_member.id} - id آخر عضو مسجل.<br />
	{\\$latest_member.name} - اسم آخر عضو مسجل.';
$helptxt['attachmentEncryptFilenames'] = 'تشفير أسماء ملفات الملحقات يسمح لك بوجود أكثر من ملحق بنفس الاسم، وذلك يوفر لك أمان أكثر في استخدام ملفات php و يحسن من الأمان. ولكن ذلك قد يتسبب في صعوبة في إعادة إنشاء قاعدة البيانات إلا إذا وقع لها ضرر كبير.';

$helptxt['failed_login_threshold'] = 'تحديد عدد محاولات الدخول الفاشلة قبل أن يتم نقل العضو إلى صفحة التذكير بكلمة المرور.';
$helptxt['oldTopicDays'] = 'إذا كان هذا الخيار يعمل فإنه سوف تظهر رساله تحذيريه للأعضاء عندما يحاولون الرد على موضوع قديم ,تخبرهم بأن هذا الموضوع لم يتم الرد عليه منذ فترة طويله , أكتب 0 لكى يتم تعطيل هذه الميزه .';
$helptxt['edit_wait_time'] = 'عدد الثواني المسموح بها لتحرير الرسالة قبل ظهور "حررت في".';
$helptxt['edit_disable_time'] = 'عدد الدقائق التى يجب على العضو إنتظارها قبل تعديل مشاركته. أكتب 0 لإيقافها. <br /><br /><i>ملحوظه : هذه الميزة لن تضر الأعضاء الذين لديهم الحق فى تعديل مشاركات الأخرين.</i>';
$helptxt['posts_require_captcha'] = 'This setting will force users to enter a code shown on a verification image each time they make a post to the board. Only users with a post count below the number set will need to enter the code - this should help combat automated spamming scripts.';
$helptxt['enableSpellChecking'] = 'تمكين التدقيق الإملائي. يجب أن تتوفر لديك مكتبة pspell مثبتة في ملقمك و يتم ضبط PHP لاستخدام pspell. ملقمك ' . (function_exists('pspell_new') == 1 ? 'يملك' : 'لا يملك') . ' تلك المكتبة.';
$helptxt['disable_wysiwyg'] = 'هذا الإعداد يمنع جميع الأعضاء من استخدام محرر WYSIWYG (&quot;ما تشاهده هو ما تحصل عليه&quot;) بصفحة المشاركة';
$helptxt['lastActive'] = 'حدد الدقائق لعرض الأشخاص النشطين في آخر دقائق في المنتدى والذي يعرض في فهرس المنتدى. عدد الدقائق الافتراضية هو 15.';

$helptxt['customoptions'] = 'This section defines the options that a user may choose from a drop down list. There are a few key points to note in this section:
	<ul>
		<li><b>Default Option:</b> Whichever option box has the &quot;radio button&quot; next to it selected will be the default selection for the user when they enter their profile.</li>
		<li><b>Removing Options:</b> To remove an option simply empty the text box for that option - all users with that selected will have their option cleared.</li>
		<li><b>Reordering Options:</b> You can reorder the options by moving text around between the boxes. However - an important note - you must make sure you do <b>not</b> change the text when reordering options as otherwise user data will be lost.</li>
	</ul>';

$helptxt['autoOptDatabase'] = 'يحسّن هذا الخيار قاعدة البيانات كلّ العديد من الأيام. اكتب 1 لتحقيق أمثلية يومية. تستطيع تحديد عدد أقصى عضو متصلين الآن لكي لا تتسبب لهم بالإزعاج و كذلك لا تحمل ملقمك عبء إضافي.';
$helptxt['autoFixDatabase'] = 'سيقوم بإصلاح الجداول المكسورة تلقائيا و المواصلة كان شيء لم يحدث لمنتداك. وهذا مفيد لأن الطريقة الوحيدة للإصلاح هي بإصلاح الجدول وهكذا فلن يتم إيقاف منتداك حتى تشعر بذلك. سيتم بعث رسالة إليك عند حدوث ذلك.';

$helptxt['enableParticipation'] = 'لعرض أيقونة صغيرة  للمواضيع التي قام العضو بالمشاركة فيها.';

$helptxt['db_persist'] = 'الإبقاء على الاتصال نشطا من أجل تحسين الأداء. إذا لم يكن موقعك يملك خادما مستقلا فقد يسبب لك ذلك مشكلة مع مضيفك إذا لم يكن مسموح لك باستخدام تلك الميزة.';
$helptxt['ssi_db_user'] = 'إعدادات إختيارية لإستخدام قاعدة بيانات مختلفة (لأسماء المستخدمين و كلمات المرورو) فى حالة إستخدمك SSI.php .';

$helptxt['queryless_urls'] = 'سيقوم هذا بتغير شكل الـ URLs بشكل طفيف من أجل محركات البحث.  ستكون مشابه للتالي index.php/topic,1.html.

هذه الميزة ' . (strpos(php_sapi_name(), 'apache') !== false ? '' : 'not') . ' على السرفر الخاص بك.';
$helptxt['countChildPosts'] = 'إذا فعلت هذا الخيار فهذا يعنى أن الردود و المواضيع فى المنتديات و الاقسام الفرعيه سوف يتم جمعهم جميعا و سوف تظهر فى الصفحه الرئيسيه للمنتدى .<br /><br />هذا سوف يجعل الأمر بطيئ, لكنها ستجعل الأقسام الرئيسيه التى لا تحوى مواضيع لكن أقسامها الرئيسيه يحوى مواضيع فلن يكتب بجوار هذا المنتدى فى الصفحه الرئيسيه أن مواضيعه \'0\'. ';
$helptxt['fixLongWords'] = 'هذا الخيار يقوم بفصل الكلمات الأطول من الحجم المحدد، إلى كلمات أصغر و ذلك من أجل عدم تشويه منظر الرسالة.';
$helptxt['allow_ignore_boards'] = 'إذا قمت بتفعيل هذا الخيار فهذا يعنى أنك سوف تسمح للأعضاء بإختيار الأقسام التى يريدون تجاهلها .';

$helptxt['who_enabled'] = 'هذا الخيار يمكنه تعطيل أو تمكين الأعضاء من مشاهدة من يقوم بتصفح المنتدى و ماذا يفعلون.';

$helptxt['recycle_enable'] = '&quot;سلة المهملات&quot; للمواضيع و الرسائل المحذوفة في منتدى مخصص.';

$helptxt['enableReportPM'] = 'هذه الميزه تسمح للأعضاء بالإبلاغ عن الرسائل الشخصيه لفريق الإدارة. هذه الميزه مفيده فى بعض الأحيان و ذلك لتعقب أى مخالفه تحدث عن طريق الرسائل الشخصيه.';
$helptxt['max_pm_recipients'] = 'هذا الخيار يسمح لك بتحديد الحد الأقصى من مستلمي الرسائل الشخصية في آن واحد من عضو واحد .هذه الميزه تستخدم لتقليل البريد المزعج . لاحظ أن الاعضاء المسموح لهم بإرسال النشرات الإخباريه للاعضاء سيتم استثنائهم . أكتب 0 لجعلها غير محدودة .';
$helptxt['pm_posts_verification'] = 'هذا الخيار سيجعل الأعضاء مجبرين على كتابت رمز التحقق البصرى الذى سوف يظهر لهم عند ارسال رسائل شخصيه . فقط الأعضاء الذين سيقل عدد مشاركاتهم عن الرقم الذى سوف تحدده أنت - هذا الإجراء يحمى من البريد المزعج . ';
$helptxt['pm_posts_per_hour'] = 'هذه الميزه سوف تقوم بتحديد عدد الرسائل الشخصيه التى يتم إرساله الأعضاء بعضهم للأخر فى الساعه الواحده . لاحظ انها لا تؤثر على المديرين و المشرفين';

$helptxt['default_personal_text'] = 'إسناد نص افتراضي كـ &quot;نص شخصي&quot; للأعضاء الجدد';

$helptxt['modlog_enabled'] = 'تسجيل كافة نشاطات المراقبين.';

$helptxt['guest_hideContacts'] = 'إذا فعلت هذا الخيار فإنه سوف يمنع الضيوف من مشاهدة البريد الأليكتونر الخاص بالأعضاء ';

$helptxt['registration_method'] = 'هذا الخيار لتحديد الطريقة التي تود استخدامها لتسجيل الاعضاء الجدد. يمكنك ان تختار:<br /><br />
	<ul>
		<li>
			<b>تعطيل التسجيل:</b><br />
				تعطيل التسجيل بحيث لن يقبل تسجيل اي عضو جديد.<br />
		</li><li>
			<b>تسجيل مباشر</b><br />
				الاعضاء الجدد يمكنهم تسجيل الدخول و المباشرة بالكتابة بعد تسجيلهم.<br />
		</li><li>
			<b>تفعيل التسجيل</b><br />
				سيتم إرسال رسالة بريدية للأعضاء الجدد بعد تسجيلهم تطلب منهم تفعيل اشتراكهم من خلال رابط التفعيل في الرسالة<br />
		</li><li>
			<b>الموافقة على التسجيل</b><br />
				كافة الأعضاء الجدد المسجلين يجب أن تتم الموافقة عليهم أولا من قبل المشرف.
		</li>
	</ul>';
$helptxt['register_openid'] = '<strong>Authenticate with OpenID</strong><br />
	OpenID is a means of using one username across different websites, to simplify the online experience. To use OpenID you first need to create an OpenID account - a list of providers can be found on the <a href="http://openid.net/" target="_blank">OpenID Official Site</a><br /><br />
	Once you have an OpenID account simply enter your unique identification URL into the OpenID input box and submit. You will then be taken to your providers site to verify your identity before being passed back to this site.<br /><br />
	On your first visit to this site you will be asked to confirm a couple of details before you will be recognized, after which you can login to this site and change your profile settings using just your OpenID.<br /><br />
	For more information please visit the <a href="http://openid.net/" target="_blank">OpenID Official Site</a>';

$helptxt['send_validation_onChange'] = 'عند تفعيل هذا الخيار ، فسيتوجب على أي عضو يقوم بتغير بريده من خلال الهوية تنشيط حسابه من خلال بريد سيرسل إلى العنوان الجديد';
$helptxt['send_welcomeEmail'] = 'عند تفعيل هذا الخيار ، فسيتم إرسال رسالة ترحيبيه إلى كل عضو جديد';
$helptxt['password_strength'] = 'هذه الميزه تسمح لك بالتحكم فى مدى قوة كلمة السر. كلما كانت كلمة السر قويه, كلما كان من الصعب سرقة الحيابات.
	و هناك عدة خيارات مثل:
	<ul>
		<li><b>ضعيفة:</b> أربع أحرف على الأقل.</li>
		<li><b>متوسطة:</b> لا يمكن ان تحتوى إسم المستخدم ولا بريده.</li>
		<li><b>قوية:</b> تحتوى على مجموعة من الأحرف و الرموز و ايضا لا تحوى اسم المستخدم و بريده.</li>
	</ul>';

$helptxt['coppaAge'] = 'هنا يمكنك كتابت الحد الأدنى من العمر الذى سوف يسمح للأعضاء الجدد الذين عمرهم اكبر منه من الدخول الى المنتدى مباشرتا بعد التسجيل.
	و إذا كان عمرهم أقل من الحد الأدنى فإنه سوف يتم رفض تسجيلهم أو سيكون عليهم تنشيط حسابهم عن طريق توقيع الوالدين على إستماره تفيد بذلك ,و أنت من يحدد إستخدام أى من الخيارين.
 إذا قمت بكتابت 0 فسوف يتم تعطيل هذا الخيار.';
$helptxt['coppaType'] = 'إذا كان خيار العمر الادنى للتسجيل  يعمل, إذا فإن هذه الاعدادات سوف تحدد ماذا يحدث إذا سجل شخص و كان عمره أقل من العمر الأدنى المسموح به. و هناك أمران لتختار منهما:
	<ul>
		<li>
			<b>رفض التسجيل:</b><br />
				سيتم رفض أى عضو جديد يقوم بالتسجيل إذا كان عمره أقل من العمر الأدنى المسموح به.<br />
		</li><li>
			<b>طلب موافقة الأبوين</b><br />
				إذا قام بالتسجيل شخص عمره أقل من الحد الأدنى المسموح به فإنه يجب تنشيط حسابه, و ذلك عن طريق موافقة أبويه على تسجيل عن طريق الإمضاء على إستمارة تسجيل تكتبها انت.
 و يجب أن توفر لهم البيانات اللاذمه التى سوف يحتاجونها لإرسال الاستماره بعد الموافقه عليها , كعنوان البريد أو رقم الفاكس.
		</li>
	</ul>';
$helptxt['coppaPost'] = 'إن صتدوق العنوان البريدى مطلوب و يجب كتابته حيث أنه سوف يستخدم فى إرسال رسالة تأكيد طلب العضو الذى سنه أصغر من العمر المسموح به للتسجيل الى المدير . هذه المعلومات ستظهر لكل الأعضاء الذى عمرهم لم يتجاوز السن المسموح به للتسجيل بعد , و هذه المعلومات هامه لولى أمره/الواصى عليه . و على الأقل يجب كتابت العنوان البريدى هنا أو رقم الفاكس بالأسفل .';

$helptxt['allow_hideOnline'] = 'عند تفعيل هذا الخيار سيتمكن الأعضاء من استخدام خاصية التخفي عن الكل (ما عدا المشرفين و المراقبين). إذا لم يتم تنشيط هذا الخيار فسيمكن للمراقبين على المنتدى فقط من استخدام خاصية التخفي. تذكر أن عدم تفعيل هذا الخيار لن يوثر على حالة الأعضاء ولكن سيمنع عنهم إمكانية استخدام خاصية التخفي في المستقبل.';
$helptxt['make_email_viewable'] = 'If this option is enabled instead of users email addresses being hidden to normal members and guests they will be publicly viewable on the forum. Enabling this will put your users at greater risk of being victims of spam as a result of email harvesters visiting your forum. Note this setting does not override the user setting for hiding their email address from users. Enabling this setting is <strong>not</strong> recommended.';
$helptxt['meta_keywords'] = 'هذه الكلمات يتم إرسالها فى جميع صفحات المنتدى لكى يتم تضمينها لموقعك فى محركات البحث . و يجب وضع فاصلة بين كل كلمة و الأخرى, و لا تقم بإستخدام HTML. إذا تركتها فارغة فسيتم إستخدام الكلمات الإفتراضية. و التى هى:<br /><div class="smalltext">&quot;PHP, MySQL, bulletin, board, free, open, source, smf, simple, machines, forum&quot;</div> ';

$helptxt['latest_support'] = 'يعرض لك هذا التبويب بعض المشاكل و الأسئلة حول تضبيطات ملقمك. لا تقلق فلن يتم تسجيل أي من المعلومات هنا.<br /><br />اذ تم عرض &quot;جلب معلومات الدعم...&quot; دائما, فالغالب أن جهازك لا يستطيع الاتصال بـ <a href="http://www.simplemachines.org/">www.simplemachines.org</a>.';
$helptxt['latest_packages'] = 'هنا يمكنك أن تشاهد بعض الرزم و المعدلات الحديثة, و المتسمة بسهولة التثبيت.<br /><br />إذا لم يتم عرض هذا التبويب, فالأرجح أن جهازك لا يستطيع الاتصال بـ <a href="http://www.simplemachines.org/">www.simplemachines.org</a>.';
$helptxt['latest_themes'] = 'يعرض هذا التبويب بعض القوالب الحديثة و المشهورة من <a href="http://www.simplemachines.org/">www.simplemachines.org</a>.  قد لا يعرض بشكل سليم إذا لم يتمكن جهازك من الاتصال بـ <a href="http://www.simplemachines.org/">www.simplemachines.org</a>.';

$helptxt['secret_why_blank'] = 'من أجل حمايتك ، فأن الجواب على سؤالك ( و كذلك كلمة المرور) يتم تشفيرها بحيث لا يستطيع SMF إخبارك بها إلا في حالة الجواب الصحيح ، لذا فلن يتم اطلاعك (أو أي شخص آخر) ما هو سؤالك أو كلمة المرور.';
$helptxt['moderator_why_missing'] = 'بما أن المراقبة تتم على أساس كل منتدى على حدة, فيتوجب عليك أن تجعل الأعضاء مراقبين من خلال <a href="javascript:window.open(\'%s?action=manageboards\'); self.close();">معالجة المنتديات</a>.';

$helptxt['permissions'] = 'التصاريح هي تلك الميزات التي تسمح من خلالها أو تمنع من خلالها مجموعة ما من فعل شيء معين.<br /><br />يمكنك تعديل منتديات عدة دفعة واحدة باستخدام صناديق التعليم، أو مشاهدة التصاريح لمجموعة محددة بالنقر على \'تعديل.\'';
$helptxt['permissions_board'] = 'إذا تم ضبط المنتدى على \'عام,\' فذلك يعني بأن المنتدى لن يملك تصاريح خاصة.  \'محلي\' يعني بأن المنتدى سيملك تصاريحه الخاصة منفصلة عن التصاريح العامة.  و هذا يسمح لك بأن يكون هنالك منتدى يملك تصاريح أقل أو أكثر من الآخر، من دون الحاجة لضبطهم لكل منتدى.';
$helptxt['permissions_quickgroups'] = '
هذه تسمح لك باستخدام تشكيلات التصاريح &quot;الافتراضية&quot; - قياسي تعني \'لا شيء خاصّ\', تقيديه تعني \'مثل الضيوف\', مراقب تعني \'خصائص المراقب\', و أخيرا \'صيانة\' تعني تصاريح مقاربة لتلك الخاصة بالمشرف .';
$helptxt['permissions_deny'] = 'إن مجموعة الاعضاء المقييده تكون مفيده فى بعض الاحيان حيث أنها تجعلك قادر على أخذ ميزه معينه لدى شخص معين . يمكنك عمل مجموعة أعضاء تسمى \'تقييدي\'- و تضع بها العضو الذى تريد حرمانه من ميزه معينه.<br /><br />إستخدمها بحذر, فهى ستقوم بمنع الأعضاء الموجودين بهذه المجموعه من بعض مميزاتهم مهما كانت مجموعاتهم الأساسيه. ';
$helptxt['permissions_postgroups'] = 'تمكين ميزة تفعيل صلاحيات المجموعات التي تعتمد على عدد المشاركات ستجعلك قادر على وضع تصاريح خاصه بكل مجموعه من  المجموعات الخاصة بعدد الرسائل. فإن تصاريح المجموعات الخاصة بعدد الرسائل سوف  <em>تضاف</em> الى التصاريح بواسطة مجموعة الأعضاء.';
$helptxt['membergroup_guests'] = 'إن مجموعة ضيوف غير مسجلين هم الزوار .';
$helptxt['membergroup_regular_members'] = 'الأعضاء العاديون هم جميع أعضاء المنتدى الذين قامو بتسجيل دخولهم , لكنهم لا ينتمون لمجموعه معينه.';
$helptxt['membergroup_administrator'] = 'المدير يمكنه فعل أى شيئ و كل شيئ , لذلك لا يمكن تعديل التصاريح الخاصه به.';
$helptxt['membergroup_moderator'] = 'إن مجموعة المشرفين هى مجموعه خاصه. حيث لديهم تصاريح و إعدادات خاصه بإدارة المنتدى لكن فقط <em>فى القسم الذى يقومون بالإشراف عليه</em>. أما خارج هذا القسم فهم أعضاء عاديون لا يملكون تصاريح خارج قسمهم.';
$helptxt['membergroups'] = 'في SMF يوجد نوعين من المجموعات يمكن للأعضاء أن ينتموا إليهم. وهم:
	<ul>
		<li><b>مجموعات عادية:</b> و هي مجموعة لا يتم إضافة الأعضاء إليها تلقائيا. لإضافة عضو إلى المجموعة ، اذهب إلى هوية ذلك العضو و اختر &quot;إعدادات الحساب&quot; ، ومن خلال تلك الصفحة يمكنك تعيين أي عضو لأي عدد من المجموعات العادية التي سيكونون أعضاء فيها.</li>
		<li><b>مجموعات الكتابة:</b> بعكس المجموعات العادية ، فهذه المجموعات لا يمكنك أن تعيين لها أعضاء يدويا. بل يتم انتساب الأعضاء لها تلقائيا بمجرد ما أن يحصل العضو على العدد المعين من كتابة الرسائل التي تخوله في الدخول إلى تلك المجموعة.</li>
	</ul>';

$helptxt['calendar_how_edit'] = 'يمكنك تحرير هذه الأحداث بواسطة النقر على النجمة الحمراء (*) بجانب الأسماء.';

$helptxt['maintenance_backup'] = 'هذه المنطقة تسمح لك بأخذ نسخة من كافة الرسائل, الإعدادات, الأعضاء, و أية معلومات أخرى في منتداك إلى ملف كبير.<br /><br />من المستحسن فعل ذلك دوريا كل أسبوع مثلا من اجل الحماية و عدم فقدان البيانات.';
$helptxt['maintenance_rot'] = 'هذا يسمح لك بأن تحذف الرسائل القديمة <b>كليا</b> و <b>بشكل غير قابل للاسترجاع</b>.  من المستحسن أخذ نسخة احتياطية أولا, فقط تحسبا لعدم فقدان أية بيانات مهمة.<br /><br />استخدم هذا الخيار بحذر.';
$helptxt['maintenance_members'] = 'This allows you to <strong>completely</strong> and <strong>irrevocably</strong> remove member accounts from your forum.  It is <strong>highly</strong> recommended that you try to make a backup first, just in case you remove something you didn\'t mean to.<br /><br />Use this option with care.';

$helptxt['avatar_server_stored'] = 'هذا يسمح للأعضاء بإختيار صورة شخصية من الصورة المخزنة على الخادم الخاص بك. و التى هى موجودة فى مجلد الصور الشخصية \'avatars\' الخاص بالمنتدى .';
$helptxt['avatar_external'] = 'عند تفعيل هذا الخيار , فإن الأعضاء يمكنهم كتابة عنوان رابط الصورة الشخصية الخاصة بهم . فإنه فى بعض الأحيان قد يريدون إستخدام صور شخصية كبيرة قد لا تريدها على منتداك .';
$helptxt['avatar_download_external'] = 'هذه الميزه تسمح للأعضاء بإضافة صوره شخصيه لهم عن طريق رابط للصوره , سيتم تحميل الصوره منه و حفظها بمجلد الصور الشخصيه بموقعك.';
$helptxt['avatar_upload'] = 'هذا الخيار يشبه &quot;السماح للاعضاء بإختيار صور عن طريق رابط&quot;, إلا انه هنا سوف يكون لديك سيطرة أفضل على الصور الشخصية, حيث يمكنك إعداة تحجيمها, و حيث أن الأعضاء قد لا يجدون مكان لرفع الصورة عليه.<br /><br />و مع ذلك , فإن الجانب السيئ فى الامر أن هذا سوف يأخذ من مساحت خادمك.';
$helptxt['avatar_download_png'] = 'الصور نوع PNG كبيرة نوعا ما, ولكنها تدعم الضغط بشكل أفضل.  إذا لم يتم تفعيل هذا الخيار, فسيتم استخدام JPEG بدلا - والتي تمتاز بالصغر نوعا ما, ولكن بنوعية اقل جودة.';

$helptxt['disableHostnameLookup'] = 'لتعطيل host name lookups , والتي تكون بطيئة في بعض الملقمات. تذكر بأن هذا سيؤثر على فاعلية الحظر';

$helptxt['search_weight_frequency'] = 'عوامل الوزن تستخدم للتحكم في أهمية علاقة نتائج البحث. قم بتغير عوامل الوزن لتوافق الأشياء المهمة لمنتداك. مثلا, منتدى خاص بالأخبار, يحتاج إلى قيمة عالية خاصة  \'عمر آخر رسالة مطابقة\'. كلّ القيم نسبية فيما يتعلق ببعضهم البعض و يجب أن تكون أرقام صحيحة.<br /><br />يحسب هذا العامل كمية مطابقة الرسائل ويقسّمهم بالعدد الكليّ للرسائل ضمن الموضوع.';
$helptxt['search_weight_age'] = 'عوامل الوزن تستخدم للتحكم في أهمية علاقة نتائج البحث. قم بتغير عوامل الوزن لتوافق الأشياء المهمة لمنتداك. مثلا, منتدى خاص بالأخبار, يحتاج إلى قيمة عالية خاصة  \'عمر آخر رسالة مطابقة\'. كلّ القيم نسبية فيما يتعلق ببعضهم البعض و يجب أن تكون أرقام صحيحة.<br /><br />يقدّر هذا العامل عمر الرسالة المطابقة الأخيرة ضمن موضوع. كلما كانت الرسالة أحدث كلما كانت النتيجة أعلى.';
$helptxt['search_weight_length'] = 'عوامل الوزن تستخدم للتحكم في أهمية علاقة نتائج البحث. قم بتغير عوامل الوزن لتوافق الأشياء المهمة لمنتداك. مثلا, منتدى خاص بالأخبار, يحتاج إلى قيمة عالية خاصة  \'عمر آخر رسالة مطابقة\'. كلّ القيم نسبية فيما يتعلق ببعضهم البعض و يجب أن تكون أرقام صحيحة.<br /><br />هذا العامل مستند على حجم الموضوع. كلما كانت الرسائل داخل الموضوع أكثر كلما كانت النتيجة أعلى.';
$helptxt['search_weight_subject'] = 'عوامل الوزن تستخدم للتحكم في أهمية علاقة نتائج البحث. قم بتغير عوامل الوزن لتوافق الأشياء المهمة لمنتداك. مثلا, منتدى خاص بالأخبار, يحتاج إلى قيمة عالية خاصة  \'عمر آخر رسالة مطابقة\'. كلّ القيم نسبية فيما يتعلق ببعضهم البعض و يجب أن تكون أرقام صحيحة.<br /><br />هذا العامل ينظر إذا أمكن العثور على البحث في عنوان الموضوع.';
$helptxt['search_weight_first_message'] = 'عوامل الوزن تستخدم للتحكم في أهمية علاقة نتائج البحث. قم بتغير عوامل الوزن لتوافق الأشياء المهمة لمنتداك. مثلا, منتدى خاص بالأخبار, يحتاج إلى قيمة عالية خاصة  \'عمر آخر رسالة مطابقة\'. كلّ القيم نسبية فيما يتعلق ببعضهم البعض و يجب أن تكون أرقام صحيحة.<br /><br />هذا العامل ينظر إذا أمكن العثور على البحث في أول رسالة من الموضوع.';
$helptxt['search_weight_sticky'] = 'عوامل الوزن تستخدم للتحكم في أهمية علاقة نتائج البحث. قم بتغير عوامل الوزن لتوافق الأشياء المهمة لمنتداك. مثلا, منتدى خاص بالأخبار, يحتاج إلى قيمة عالية خاصة \'عمر آخر رسالة مطابقة\'. كلّ القيم نسبية فيما يتعلق ببعضهم البعض و يجب أن تكون أرقام صحيحة.

يقدّر هذا العامل عمر الرسالة المطابقة الأخيرة ضمن موضوع. كلما كانت الرسالة أحدث كلما كانت النتيجة أعلى.';
$helptxt['search'] = 'هنا يمكنك تعديل جميع إعدادات وظيفة البحث .';
$helptxt['search_why_use_index'] = 'فهرس البحث يستطيع أن يزيد فعالية أداة اليحث كثيرا. خاصة عندما عدد رسائل المنتدى تزداد باستمرار, أوزان البحث من حيث المواضيع المتصلة قد يأخد و قتا أطول في حال عدم وجود فهرس للبحث كما قد يسبب ضغط على قواعد المعطيات لديك. إذا كان لديك أكثر من 50,000 رسالة فمن الأفضل أن تنشأ فهرس بحث من أجل أداء أفضل<br /><br />ملاحظة : إن فهرس البحث قد يستهلك مساحة ليست صغيرة.فهرس كامل النص هو ضمن تعليمات MySQL الأساسية. مدمج نسبيا(تأخذ تقريبا مساحة جدول الرسائل), لكن كثير من الكلمات غير مفهرسة و يمكن لبعض سلاسل البحث أن تكون بطيئة نسبيا. الفهرس الخاص يكون عادة أكير حجما(اعتمادا على إعداداتك قد يصل إلى 3 أضعاف جدول الرسائل) لكن أداءه أفضل من فهرس نص كامل و نسبيا أكثر استقرارا';

$helptxt['see_admin_ip'] = 'عناوين IP تعرض للمشرفين و المراقبين من اجل تسهيل عملية الإشراف و لتعقب الأعضاء الغير مرغوب فيهم.  تذكر بان عناوين IP لا يمكن أن تحدد الهوية دائما, و كذاك فان اغلب عناوين IP للأشخاص تتغير باستمرار.<br /><br />الأعضاء يسمح لهم بمشاهدة عناوين IP الخاص بهم.';
$helptxt['see_member_ip'] = 'عنوان IP الخص بك ، يعرض لك و للمراقب فقط.  تذكر بأن هذه العناوين لا تدل على الهوية دائما كما أن العناوين تتغير باستمرار.<br /><br />لا يمكنك مشاهدة عناوين IP الغير, كما لا يمكنهم مشاهدة عنوانك.';
$helptxt['whytwoip'] = 'SMF uses various methods to detect user IP addresses. Usually these two methods result in the same address but in some cases more than one address may be detected. In this case SMF logs both addresses, and uses them both for ban checks (etc). You can click on either address to track that IP and ban if necessary.';

$helptxt['ban_cannot_post'] = 'إن \'لا يمكن الكتابة \' سوف يجعل المنتدى كأنه للقرأة فقط بالنسبه للأعضاء المحظورين. فلا يمكن للعضو كتابت موضوع جديد, او وضع رد لموضوع مكتوب بالفعل, وعدم إرسال رسائل شخصيه و كذلك عدم التصويت فى الإستفتاءات. الأعضاء المحظورين يمكنهم فقط قراءة المواضيع و كذلك رسائلهم الشخصيه.<br /><br />و سوف يرى العضو المحظور رساله تخبره بهذا الحظر . ';

$helptxt['posts_and_topics'] = '	<ul>
		<li>
			<b>تعديل المواضيع و العناوين </b><br />
			بامكانك تعديل جميع الاعدادات المتعلقة بالمواضيع.
		</li><li>
			<b>ود النقاط في المنتدى</b><br />
			يمكنك كود النقاط من تعديل شكل المواضيع في المنتدى. For example, to highlight the word \'house\' you can type [b]house[/b]. All Bulletin board code tags are surrounded by square brackets (\'[\' and \']\').
		</li><li>
			<b>تحرير الكلمات المراقبة</b>
			قد تحتاج إلى مراقبة بعض الكلمات الغير مناسبة التي قد يستعملها بعض الأعضاء في الكتابة.
		</li><li>
			<b>اعدادات المواضيع</b>
			بامكانك تعديل كل ما يتعلق باعدادات المواضيع.
		</li>
	</ul>';
$helptxt['spider_group'] = 'By selecting a restrictive group, when a guest is detected as a search crawler it will automatically be assigned any &quot;deny&quot; deny permissions of this group in addition to the normal permissions of a guest. You can use this to provide lesser access to a search engine than you would a normal guest. You might for example wish to create a new group called &quot;Spiders&quot; and select that here. You could then deny permission for that group to view profiles to stop spiders indexing your members profiles.<br />Note: Spider detection is not perfect and can be simulated by users so this feature is not guaranteed to restrict content only to those search engines you have added.';
$helptxt['show_spider_online'] = 'This setting allows you to select whether spiders should be listed in the who\'s online list on the board index and &quot;Who\'s Online&quot; page. Options are:
	<ul class="normallist">
		<li>
			<strong>Not at All</strong><br />
			Spiders will simply appear as guests to all users.
		</li><li>
			<strong>Show Spider Quantity</strong><br />
			The Board Index will display the number of spiders currently visiting the forum.
		</li><li>
			<strong>Show Spider Names</strong><br />
			Each spider name will be revealed, so users can see how many of each spider is currently visiting the forum - this takes effect in both the Board Index and Who\'s Online page.
		</li><li>
			<strong>Show Spider Names - Admin Only</strong><br />
			As above except only Administrators can see spider status - to all other users spiders appear as guests.
		</li>
	</ul>';

$helptxt['birthday_email'] = 'Choose the index of the birthday email message to use.  A preview will be shown in the Email Subject and Email Body fields.<br /><strong>Note:</strong> Setting this option does not automatically enable birthday emails.  To enable birthday emails use the <a href="%1$s?action=admin;area=scheduledtasks;%3$s=%2$s" target="_blank" class="new_win">Scheduled Tasks</a> page and enable the birthday email task.';
$helptxt['pm_bcc'] = 'When sending a personal message you can choose to add a recipient as BCC or &quot;Blind Carbon Copy&quot;. BCC recipients do not have their identities revealed to other recipients of the message.';

$helptxt['move_topics_maintenance'] = 'هذا سوف يسمح لك بنقل جميع المواضيع من قسم إلى قسم أخر .';
$helptxt['maintain_reattribute_posts'] = 'يمكنك إستخدام هذه الوظيفة لدمج مشاركات زائر مع عضو معين مسجل لديك . هذا الخاصية مفيدة إذا حدث على سبيل المثال أن عضو ما قم بإلغاء حسابه من المنتدى ثم بعد ذلك غير رأيه و عاد للمنتدى مرة أخرى و أراد إستعادة مشاركاته القديمة لهذا الحساب الجديد .';
$helptxt['chmod_flags'] = 'You can manually set the permissions you wish to set the selected files to. To do this enter the chmod value as a numeric (octet) value. Note - these flags will have no effect on Microsoft Windows operating systems.';

$helptxt['postmod'] = 'هذا القسم يسمح للأعضاء من فريق الإشراف (الذين لديهم تصريحات) للموافقة على أى مشاركات و مواضيع قبل ظهورها .';

$helptxt['field_show_enclosed'] = 'Encloses the user input between some text or html.  This will allow you to add more instant message providers, images or an embed etc. For example:<br /><br />
		&lt;a href="http://website.com/{INPUT}"&gt;&lt;img src="{DEFAULT_IMAGES_URL}/icon.gif" alt="{INPUT}" /&gt;&lt;/a&gt;<br /><br />
		Note that you can use the following variables:<br />
		<ul class="normallist">
			<li>{INPUT} - The input specified by the user.</li>
			<li>{SCRIPTURL} - Web address of forum.</li>
			<li>{IMAGES_URL} - Url to images folder in the users current theme.</li>
			<li>{DEFAULT_IMAGES_URL} - Url to the images folder in the default theme.</li>
		</ul>';

$helptxt['custom_mask'] = 'The input mask is important for your forum\'s security. Validating the input from a user can help ensure that data is not used in a way you do not expect. We have provided some simple regular expressions as hints.<br /><br />
	<div class="smalltext" style="margin: 0 2em">
		&quot;[A-Za-z]+&quot; - Match all upper and lower case alphabet characters.<br />
		&quot;[0-9]+&quot; - Match all numeric characters.<br />
		&quot;[A-Za-z0-9]{7}&quot; - Match all upper and lower case alphabet and numeric characters seven times.<br />
		&quot;[^0-9]?&quot; - Forbid any number from being matched.<br />
		&quot;^([A-Fa-f0-9]{3}|[A-Fa-f0-9]{6})$&quot; - Only allow 3 or 6 character hexcodes.<br />
	</div><br /><br />
	Additionally, special metacharacters ?+*^$ and {xx} can be defined.
	<div class="smalltext" style="margin: 0 2em">
		? - None or one match of previous expression.<br />
		+ - One or more of previous expression.<br />
		* - None or more of previous expression.<br />
		{xx} - An exact number from previous expression.<br />
		{xx,} - An exact number or more from previous expression.<br />
		{,xx} - An exact number or less from previous expression.<br />
		{xx,yy} - An exact match between the two numbers from previous expression.<br />
		^ - Start of string.<br />
		$ - End of string.<br />
		\\ - Escapes the next character.<br />
	</div><br /><br />
	More information and advanced techniques may be found on the internet.';

?>